# Задача: написать логику заполнения паттерна
# Первое это плотность заполнения паттерна.
# Для начала на каждом шаге разыгрывается будет ли нота, НО при этом плотность должна быть равномерной по паттерну
# Чтобы не получилось, что к примеру 45% плотность ляжет на первую половину паттерна, а дальше пусто.
# Далее разыгрыввается какая нота (скорее всего тонику берем из лада)
# Далее заполненная нота остается обязательно в памяти
# Далее разыгрывается какая нота, отталкиваясь от того какая предыдущая была 
# И здесь же учитывается как давно нота была
# Здесь же учитывается как далеко эта нота (муз интервалы)
# Далее разыгрывается, учитывая всю предыдущую инфу направление куда пойдет нота (тоже вероятности просчитаны на это)
# НО если вся дистанция паттерна уже становится длинне, чем допустимо, то точно разворачивается направление.

#ВЫДЕРЖКА:
Логика генерации на основе цепей Маркова
Цепь: Лад - плотность - интервал - направление - снэп на ноту в ладу - проверка ограничений

import random

SCALES = {
    "major":[0,2,4,5,7,9,11],
    "minor": [0,2,3,5,7,8,10],
    "dor":[0,2,3,5,7,9,10],
    "frig":[0,1,3,5,7,8,10],
    "atonal":None
}

SCALE_PROBS = {}
MAX_DIST = {}
DENSITY = {}
INTERVAL_PROBS = {} 
UP_PROBS = {}

def weighted_choice()
def step_bucket()
def snap_to_scale()

def start_note(scale):
    start = weighted_choice({0:0.80, 2:0.15, 4:0.05}) #вероятности тоники первой нотой
    return scale[start]

def select_interval()

def generate_bar()
def generate_markov()