# Задача: написать логику заполнения паттерна
# Первое это плотность заполнения паттерна.
# Для начала на каждом шаге разыгрывается будет ли нота, НО при этом плотность должна быть равномерной по паттерну
# Чтобы не получилось, что к примеру 45% плотность ляжет на первую половину паттерна, а дальше пусто.
# Далее разыгрыввается какая нота (скорее всего тонику берем из лада)
# Далее заполненная нота остается обязательно в памяти
# Далее разыгрывается какая нота, отталкиваясь от того какая предыдущая была 
# И здесь же учитывается как давно нота была
# Здесь же учитывается как далеко эта нота (муз интервалы)
# Далее разыгрывается, учитывая всю предыдущую инфу направление куда пойдет нота (тоже вероятности просчитаны на это)
# НО если вся дистанция паттерна уже становится длинне, чем допустимо, то точно разворачивается направление.

#ВЫДЕРЖКА:
Логика генерации на основе цепей Маркова
Цепь: Лад - плотность - интервал - направление - снэп на ноту в ладу - проверка ограничений

import random

SCALES = {
    "major":[0,2,4,5,7,9,11],
    "minor": [0,2,3,5,7,8,10],
    "dor":[0,2,3,5,7,9,10],
    "frig":[0,1,3,5,7,8,10],
    "atonal":None
}

SCALE_PROBS = {
    "detroit_bass":{"major": 0.075,"minor": 0.375,"dor": 0.225,"frig": 0.325},
    "detroit_lead":{"major": 0.075,"minor": 0.325,"dor": 0.375,"frig": 0.225},
    "industrial_bass":{"major": 0.025,"minor": 0.375,"dor": 0.125,"frig": 0.475},
    "industrial_lead":{"major": 0.025,"minor": 0.225,"dor": 0.125,"frig": 0.350,"atonal": 0.275}
}

MAX_DIST = {
    "detroit_bass": 7,
    "detroit_lead": 10,
    "industrial_bass": 9,
    "industrial_lead": 9
}

DENSITY = {
    "detroit_bass": [0.90, 0.35, 0.65, 0.40, 0.55, 0.30, 0.65, 0.45, 0.80, 0.35, 0.65, 0.40, 0.55, 0.30, 0.70, 0.35],
    "detroit_lead": [0.75, 0.20, 0.40, 0.25, 0.50, 0.30, 0.45, 0.35, 0.65, 0.25, 0.45, 0.30, 0.55, 0.20, 0.50, 0.25],
    "industrial_bass": [0.70, 0.55, 0.65, 0.50, 0.60, 0.45, 0.65, 0.55, 0.75, 0.55, 0.65, 0.50, 0.65, 0.45, 0.70, 0.50],
    "industrial_lead": [0.50, 0.15, 0.25, 0.15, 0.35, 0.20, 0.30, 0.20, 0.45, 0.10, 0.20, 0.15, 0.35, 0.10, 0.25, 0.15]
}
INTERVAL_PROBS = {
    
} 
UP_PROBS = {}

def weighted_choice()
def step_bucket()
def snap_to_scale()

def start_note(scale):
    start = weighted_choice({0:0.80, 2:0.15, 4:0.05}) #вероятности тоники первой нотой
    return scale[start]

def select_interval()

def generate_bar()
def generate_markov()